from pydub import AudioSegment

def to_seconds(timestr):
    seconds = 0
    for part in timestr.split(':'):
        seconds = seconds*60 + int(part, 10)
    return seconds


arr = [
"01. Рюмка водки на столе","00:00",
"02. Я поднимаю руки","04:18",
"03. Старый черт","08:09",
"04. Зеркала(feat. Ани Лорак)","11:45",
"05. Если хочешь - уходи","15:28",
"06. Ну и что","19:01",
"07. Выбрось из головы","24:38",
"08. Самый лучший день","28:08",
"09. Я счастливый","32:27",
"10. Что ж ты натворила","36:25",
"11. Аминь","40:01",
"12. Небо на ладони","44:02",
"13. Господи, дай мне сил","47:53",
"14. Я тебя не люблю","50:59",
"15. Она не твоя(feat. Стас Пьеха)","54:14",
"16. Водопадом","57:52",
"17. Уходи красиво","01:02:12",
"18. Терминатор","01:06:06",
"19. Натали","01:10:04",
"20. Уходи по-английски(feat. Ани Лорак)","01:14:51",
"21. Вечерняя застольная(feat. Александр Розенбаум и Иосиф Кобзон)","01:18:27",
"22. Разбитая любовь","01:22:27",
"23. Вьюга","01:25:50",
"24. Четвертиночка(feat. Александр Розенбаум)","01:30:27",
"25. Я слушал дождь","01:34:06",
"26. Плен(feat. Артем Лоик)","01:39:37",
"27. Гоп-стоп(feat. Александр Розенбаум)","01:43:56",
"28. Ты пришла... ","01:47:45",
"29. Ангел ушел в запой(Бокареву А. Р. посвящается)","01:51:21",
"30. Не жди меня(feat. Слава)","01:54:44",
"31. Стаканы","01:58:48",
"32. Московская песня","02:01:27",
"33. Первый день рожденья","02:04:55",
"34. Лабиринт","02:09:41",
"35. Бессонница","02:14:43",
"36. Крыса-ревность","02:18:53",
"37. Зачем я тебе? ","02:23:02",
"38. Расскажи","02:26:33",
"39. Что может человек? ","02:32:16",
"40. Самолеты, поезда или машины(feat. Артем Лоик)","02:39:18",
"41. ТыЧегоТакойСерьезный(feat. Тимати)","02:44:40",
"42. Спокойной ночи, господа","02:49:04",
"43. Шелест","02:54:34",
"44. В центре Земли","02:58:34",
"45. Замерзает Солнце","03:03:05",
"46. Раздумья мои","03:08:13",
"47. Роковая любовь","03:13:24",
"48. Черный дождь","03:18:11",
"49. Песня о друге","03:22:30",
"50. Больше не будет","03:27:21",
]
#from pydub.utils import which
#.*(?=.*\()
#   "$0",
#AudioSegment.converter = which("ffmpeg")
AudioSegment.converter = "C:/ffmpeg/bin/ffmpeg"

songs = AudioSegment.from_mp3("1.mp3")
start= 0
end = 0
for inx, song in enumerate(arr):
    if(inx%2!=0):
        end = to_seconds(song)
        newPart = song[start*1000:end*1000]
        nameSong = song[inx-1]+".mp3"
        newPart.export("nameSong", format="mp3")
        start=end
        


